/**
  ******************************************************************************
  * @file           : delay.c
  * @brief          : 延时
  ******************************************************************************
  **
	*w
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "delay.h"
#include "tim.h"

/*****************************
us延迟
定时器要配置为72-1分频，计数方式向下，
*****************************/
void delay_us(uint16_t us)
{
   TIM1->CNT = us-1;		//装载数值到定时器
    TIM1->CR1 |= TIM_CR1_CEN;		//允许计数
    while((TIM1->SR & TIM_FLAG_UPDATE)!=SET);//没更新就循环

    TIM1->SR = (uint16_t)~TIM_FLAG_UPDATE;//TIM的状态寄存器
    TIM1->CR1 &= ~TIM_CR1_CEN;		//禁止计数
}


/*****************************
ms延迟
间接调用HAL库的HAL_Delay()
*****************************/
void delay_ms(uint32_t ms)
{
	(ms>1)?ms--:1;	//减1ms才是准确延时
	HAL_Delay(ms);
}

