/**
  ******************************************************************************
  * @file           : KEY.h
  * @brief          : 按键处理
  ******************************************************************************
  **
	*该按键处理函数放在定时器内进行处理
  *
  ******************************************************************************
  */
#ifndef __KEY_H
#define __KEY_H
/*----------------------------------------------------------------------------**
**头文件               																									  		
**----------------------------------------------------------------------------*/
#include "main.h"

/*----------------------------------------------------------------------------**
**定义 常 变 量              																									
**----------------------------------------------------------------------------*/
#define KEY_TIM_PERIOD	1		//按键处理所在定时器的中断周期（处理周期）
#define KEY_LONGVALUE (600/KEY_TIM_PERIOD)	//长按时长判定点，600ms

typedef struct
{
	uint16_t KeepLong;		//按键接通时长
	uint8_t  KEY_DOWN;		//按键被按下
	uint8_t  KEY_LONG;		//按键被长按
}KEY;

extern KEY Key1, Key2, Key3, Key4;		//声明：给每个按键赋予一个KEY状态结构体

/*----------------------------------------------------------------------------**
**函数声明                																								 		
**----------------------------------------------------------------------------*/
void KeyClear(KEY *KEYstr);			//复位按键标志位
void InitAllKeys(void);		// 复位所有按钮标志
void OnTIMForKeysHandler(void);			// 定时器内处理

#endif
