/**
  ******************************************************************************
  * @file           : BH1750.h
  * @brief          : 光强度传感器驱动，IIC通信
  ******************************************************************************
  **
	*
  *
  ******************************************************************************
  */
#ifndef __BH1750_H
#define __BH1750_H
/*----------------------------------------------------------------------------*/
/*头文件               																									   */
/*----------------------------------------------------------------------------*/
#include "my_IIC.h"

/*----------------------------------------------------------------------------*/
/*常变量定义        																									   */
/*----------------------------------------------------------------------------*/
#define 	IICSLADDR_BH1750 0x46
#define   BS1750_DOWN     0x00 // 断电指令
#define   BH1750_ON   		0x01 // 通电指令
#define   BH1750_RSET     0x07 // 重置指令
#define	  BH1750_CON_H  	0x10 // 连续高分辨率模式，1lx，120ms
#define	  BH1750_CON_H2  	0x11 // 连续高分辨率模式，0.5lx，120ms
#define	  BH1750_CON_L  	0x13 // 连续低分辨率模式，4lx，16ms
#define   BH1750_ONE_H  	0x20 // 一次高分辨率模式，1lx，120ms
#define   BH1750_ONE_H2		0x21 // 一次高分辨率模式，0.5lx，120ms
#define	  BH1750_ONE_L 		0x23 // 一次低分辨率模式，4lx，16ms

#define  RESOLUTION  BH1750_CON_H // 连续高分辨率模式，0.5lx
 
#if RESOLUTION == BH1750_CON_H || RESOLUTION == BH1750_ONE_H
    #define SCALE_INTERVAL 1
#elif RESOLUTION == BH1750_CON_H2 || RESOLUTION == BH1750_ONE_H2
    #define SCALE_INTERVAL 0.5f
#elif	RESOLUTION == BH1750_CON_L || RESOLUTION == BH1750_ONE_L
    #define SCALE_INTERVAL 4
#endif

/*----------------------------------------------------------------------------*/
/*函数声明                																								   */
/*----------------------------------------------------------------------------*/
enum boolType BH1750_Init(void);		//BH1750初始化
uint16_t BH1750_RawData(void);		//从传感器获取原数据
float BH1750_transValue(void);//将原数据转为光照强度，单位lx.

#endif
