/**
  ******************************************************************************
  * @file           : KEY.h
  * @brief          : 按键处理
  ******************************************************************************
  **
	*该按键处理函数放在定时器内进行处理
  *
  ******************************************************************************
  */
#ifndef __KEY_H
#define __KEY_H
/*----------------------------------------------------------------------------*/
/*头文件               																									  */
/*----------------------------------------------------------------------------*/
#include "main.h"

/*----------------------------------------------------------------------------*/
/*定义 常 变 量              																							*/
/*----------------------------------------------------------------------------*/
#define T_TIM	10		//按键处理所在定时器的中断周期（处理周期）
#define KEY_LONGVALUE (1000/T_TIM)	//长按时长判定点，1s

typedef struct
{
	uint16_t KeepLong;		//按键接通时长
	uint8_t  KEY_State;		//记录按键状态
	uint8_t  KEY_DOWN;		//按键被按下
	uint8_t  KEY_LONG;		//按键被长按
	uint8_t  KEY_UP;			//按键被释放
}KEY;

extern KEY KEY_NEXT,KEY_ENTER;		//声明：给每个按键赋予一个KEY状态结构体

/*----------------------------------------------------------------------------*/
/*函数声明                																								 */
/*----------------------------------------------------------------------------*/
void KeyClear(KEY *KEYstr);			//复位按键标志位
void KeyHandlers(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, KEY *KEYstr);		//按键处理（给中断用）
#endif
